Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/criminal_offences/drug_offences.html.txt.tmx
Source language: en
Languages: ga

source: Based on this application, the court can review your case and revoke the detention order
ga: Ar bhunús an iarratais sin, féadfaidh an chúirt do chás a athbhreithniú agus an t-ordú coinneála a chealú

source: It then has a number of options open to it
ga: Bíonn cúpla rogha ar oscailt di ansin

source: If the court decides that you are still in need of treatment, it can order your continued detention, possibly in another treatment centre
ga: Má mheasann sí go bhfuil cóireáil fós ag teastáil uait féadfaidh sí do choinneáil leanúnach a ordú – in ionad eile más gá é sin

source: If custodial treatment is not considered necessary, you may be ordered to continue treatment but not on a custodial basis
ga: Mura meastar cóireáil choinneála a bheith de dhíth, d’fhéadfaí tú a ordú leanúint den chóireáil ach gan í a bheith ar bhonn coinneála

source: The court can also decide to impose the usual penalties (prison sentence and/or fine) under the Misuse of Drugs Act for your offence if it considers it appropriate to do so
ga: Féadfaidh an chúirt na gnáthphionóis a ghearradh ort faoin Acht um Mí-Úsáid Drugaí – fíneáil agus/nó tréimhse phríosúnachta – má mheasann sí iad a bheith cuí

source: This will depend on the circumstances of your case and if a prison sentence is imposed, the court must take into account the amount of time you have already been detained in a treatment centre
ga: Braithfidh sé seo ar chúinsí do cháis, agus má ghearrtar príosúnacht ort, caithfidh an chúirt an méid ama atá caite agat san ionad cóireála a chur san áireamh

source: The court also has the option of not
ga: Bíonn sé de rogha ag an gcúirt gan pionós ar bith a ghearradh ort má bhíonn sí sásta nach

source: imposing any penalty if it is satisfied that you are no longer in need of treatment and that the circumstances of your case do not warrant further penalties
ga: bhfuil cóireáil ag teastáil uait a thuilleadh, agus nach gá aon phionós eile i do chás féin

source: If you are unable to contact the Head Office of the Customs National Drug Team by phone, you can download the Customs Drug Watch Report Form here and send it by FREEPOST to the Customs National Drug Team's Head Office
ga: Mura féidir leat glaoch teileafóin a chur ar Ard-Oifig Fhoireann Náisiúnta Drugaí na gCustam, féadfaidh tú Foirm Tuairisce Fhaire Drugaí na gCustam a íoslódáil anseo agus í a sheoladh trí SAORPHOST go hArd-Oifig Fhoireann Náisiúnta Drugaí na gCustam

source: You can read more about the Customs Drug Watch service here (pdf) (also includes contact information for local Drugs Watch Officers)
ga: Féadfaidh tú tuilleadh a léamh faoi Seirbhís Fhaire Drugaí na gCustam anseo (pdf) (tugann sé sonraí teagmhála freisin d’Oifigigh Fhaire Drugaí áitiúla)
